barathbushan/CanDriverOnFreeRTOS/code/Project-Folder/FreeRTOS-Products/FreeRTOS-Plus-IO/Device/LPC17xx/FreeRTOS_lpc17xx_can.c
/*
 * FreeRTOS+IO V1.0.1 (C) 2012 Real Time Engineers ltd.
 *
 * FreeRTOS+IO is an add-on component to FreeRTOS.  It is not, in itself, part
 * of the FreeRTOS kernel.  FreeRTOS+IO is licensed separately from FreeRTOS,
 * and uses a different license to FreeRTOS.  FreeRTOS+IO uses a dual license
 * model, information on which is provided below:
 *
 * - Open source licensing -
 * FreeRTOS+IO is a free download and may be used, modified and distributed
 * without charge provided the user adheres to version two of the GNU General
 * Public license (GPL) and does not remove the copyright notice or this text.
 * The GPL V2 text is available on the gnu.org web site, and on the following
 * URL: http://www.FreeRTOS.org/gpl-2.0.txt
 *
 * - Commercial licensing -
 * Businesses and individuals who wish to incorporate FreeRTOS+IO into
 * proprietary software for redistribution in any form must first obtain a low
 * cost commercial license - and in-so-doing support the maintenance, support
 * and further development of the FreeRTOS+IO product.  Commercial licenses can
 * be obtained from http://shop.freertos.org and do not require any source files
 * to be changed.
 *
 * FreeRTOS+IO is distributed in the hope that it will be useful.  You cannot
 * use FreeRTOS+IO unless you agree that you use the software 'as is'.
 * FreeRTOS+IO is provided WITHOUT ANY WARRANTY; without even the implied
 * warranties of NON-INFRINGEMENT, MERCHANTABILITY or FITNESS FOR A PARTICULAR
 * PURPOSE. Real Time Engineers Ltd. disclaims all conditions and terms, be they
 * implied, expressed, or statutory.
 *
 * 1 tab == 4 spaces!
 *
 * http://www.FreeRTOS.org
 * http://www.FreeRTOS.org/FreeRTOS-Plus
 *
 */

/* FreeRTOS includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"

/* IO library includes. */
#include "FreeRTOS_IO.h"
#include "IOUtils_Common.h"
#include "FreeRTOS_can.h"
#include "uart.h"

/* Hardware setup peripheral driver includes.  The includes for the CAN itself
is already included from FreeRTOS_IO_BSP.h. */
#include "lpc17xx_pinsel.h"

//Check out what all needs to be added in terms of the setup for the CAN Protocol, if anything at all




/* Stores the IRQ numbers of the supported CAN ports. */
//static const IRQn_Type xIRQ[] = { CAN_IRQn, CANActivity_IRQn };

/*Structures used to store Rx and Tx CAN Frames*/

static CAN_MSG_Type CAN_TxMsg,CAN_RxMsg;
static xSemaphoreHandle xSemaphore_irq;
static uint8_t enable_irq = 0;
void CAN_IRQHandler(void);

/*------------------------------- CAN_open ----------------------------------------*/

portBASE_TYPE FreeRTOS_CAN_open( Peripheral_Control_t * const pxPeripheralControl )
{
PINSEL_CFG_Type xPinConfig;
LPC_CAN_TypeDef * const pxCAN = ( LPC_CAN_TypeDef * const ) diGET_PERIPHERAL_BASE_ADDRESS( pxPeripheralControl );
portBASE_TYPE xReturn;
const uint8_t cPeripheralNumber = diGET_PERIPHERAL_NUMBER( pxPeripheralControl );
vSemaphoreCreateBinary( xSemaphore_irq );

	/* Sanity check the peripheral number. */
	if( cPeripheralNumber <= boardNUM_CANS )
	{
		pxPeripheralControl->read = FreeRTOS_CAN_read;
		pxPeripheralControl->write = FreeRTOS_CAN_write;
		pxPeripheralControl->ioctl = FreeRTOS_CAN_ioctl;


		/* Setup the pins for the CAN being used. */
		taskENTER_CRITICAL();
		{
			boardCONFIGURE_CAN_PINS( cPeripheralNumber, xPinConfig );
			
			/* Set up the default CAN configuration. */
			CAN_Init( pxCAN,boardDEFAULT_CAN_BAUD );//Setting CAN to 125000bps
			//Self-test mode selected
			//CAN_ModeConfig(pxCAN, CAN_SELFTEST_MODE, ENABLE);
			
			//Acceptance filter bypassed
			CAN_SetAFMode (LPC_CANAF, CAN_AccBP);

		}
		taskEXIT_CRITICAL();
		xReturn = pdPASS;
	}
	else
	{
		xReturn = pdFAIL;
	}

	return xReturn;
}

/*----------------------------------- CAN_write ------------------------------------------*/

size_t FreeRTOS_CAN_write( Peripheral_Descriptor_t const pxPeripheral, const void *pvBuffer, const size_t xBytes )
{
Peripheral_Control_t * const pxPeripheralControl = ( Peripheral_Control_t * const ) pxPeripheral;
LPC_CAN_TypeDef * const pxCAN = ( LPC_CAN_TypeDef * const ) diGET_PERIPHERAL_BASE_ADDRESS( ( ( Peripheral_Control_t * const ) pxPeripheral ) );
size_t xReturn = 0U;
Status SendMsgReturn;
uint8_t CANData[8] = {0}; //Temporary buffer for CAN data
uint8_t *buffPtr =(uint8_t *)pvBuffer;
int8_t counter=0;
uint8_t frame_length = CAN_TxMsg.len;
size_t index;

uint8_t self_rec=0; //Make this zero if communicating between two boards

for(index=0;index<frame_length;index++)
{
CANData[index]=*buffPtr;
buffPtr++;
}


		#if ioconfigUSE_CAN_POLLED_TX == 1
		{
			if(frame_length<=4)
			{
				for(counter=frame_length-1;counter>=0;counter--)
				{
					CAN_TxMsg.dataA[counter]=CANData[counter];
				}
			}
			else
			{
				for(counter = 3;counter>=0;counter--)
				{
				CAN_TxMsg.dataA[counter]=CANData[counter];
				}


				for(counter=0;counter<(frame_length-4);counter++)
					{
						CAN_TxMsg.dataB[counter]=CANData[counter+4];
					}
			}

			SendMsgReturn =	CAN_SendMsg (pxCAN,&CAN_TxMsg,self_rec);
			if(SendMsgReturn)
			{
			xReturn=frame_length;
			}


		}
		#endif /* ioconfigUSE_CAN_POLLED_TX */

	return xReturn;
}

/*---------------------------------- CAN_read ---------------------------------------*/

size_t FreeRTOS_CAN_read( Peripheral_Descriptor_t const pxPeripheral, void * const pvBuffer, const size_t xBytes )
{
Peripheral_Control_t * const pxPeripheralControl = ( Peripheral_Control_t * const ) pxPeripheral;
LPC_CAN_TypeDef * const pxCAN = ( LPC_CAN_TypeDef * const ) diGET_PERIPHERAL_BASE_ADDRESS( ( ( Peripheral_Control_t * const ) pxPeripheral ) );
size_t xReturn = 0U;
uint64_t data=0;
uint64_t *dataPtr=NULL;
uint8_t displace1,displace2;
int8_t counter=0;
uint8_t length;
Status RcvMsgReturn;


if(enable_irq == 0)
{
		#if ioconfigUSE_CAN_POLLED_RX == 1
		{
			RcvMsgReturn = CAN_ReceiveMsg (pxCAN,&CAN_RxMsg);
			length = CAN_RxMsg.len;
			if(length<=4)
			{
				displace1 = (length-1)*8;
				for(counter=length-1;counter>=0;counter--)
				{
					data |=(((uint64_t)CAN_RxMsg.dataA[counter])<<displace1);
					displace1 -=8;
				}
			}
			else
			{
				displace1 = 24;
				displace2 = (length-1)*8;
				for(counter=3;counter>=0;counter--)
				{
					data |=(((uint64_t)CAN_RxMsg.dataA[counter])<<displace1);
					displace1 -=8;
				}

				for(counter=length-5;counter>=0;counter--)
				{
					data |=(((uint64_t)CAN_RxMsg.dataB[counter])<<displace2);
					displace2 -=8;
				}
			}
			dataPtr=(uint64_t *)pvBuffer;
			*dataPtr=data;
			xReturn = CAN_RxMsg.len;
		}
		#endif /* ioconfigUSE_CAN_POLLED_RX */
}

else
{
	if( xSemaphoreTake( xSemaphore_irq, portMAX_DELAY) == pdTRUE )
	{
		length = CAN_RxMsg.len;
					if(length<=4)
					{
						displace1 = (length-1)*8;
						for(counter=length-1;counter>=0;counter--)
						{
							data |=(((uint64_t)CAN_RxMsg.dataA[counter])<<displace1);
							displace1 -=8;
						}
					}
					else
					{
						displace1 = 24;
						displace2 = (length-1)*8;
						for(counter=3;counter>=0;counter--)
						{
							data |=(((uint64_t)CAN_RxMsg.dataA[counter])<<displace1);
							displace1 -=8;
						}

						for(counter=length-5;counter>=0;counter--)
						{
							data |=(((uint64_t)CAN_RxMsg.dataB[counter])<<displace2);
							displace2 -=8;
						}
					}
					dataPtr=(uint64_t *)pvBuffer;
					*dataPtr=data;
					xReturn = CAN_RxMsg.len;
	}
	else
	{
		xReturn=0;
	}
}





return xReturn;
}


/*---------------------------------- CAN_ioctl ---------------------------------------*/


portBASE_TYPE FreeRTOS_CAN_ioctl( Peripheral_Descriptor_t pxPeripheral, uint32_t ulRequest, void *pvValue )
{
Peripheral_Control_t * const pxPeripheralControl = ( Peripheral_Control_t * const ) pxPeripheral;
const int8_t cPeripheralNumber = diGET_PERIPHERAL_NUMBER( ( ( Peripheral_Control_t * const ) pxPeripheral ) );
LPC_CAN_TypeDef * pxCAN = ( LPC_CAN_TypeDef * ) diGET_PERIPHERAL_BASE_ADDRESS( ( ( Peripheral_Control_t * const ) pxPeripheral ) );
CAN_PinCFG_Type xCANConfig;
FunctionalState NewState;
uint32_t ulValue = ( uint32_t ) pvValue;

portBASE_TYPE xReturn = pdPASS;

	taskENTER_CRITICAL();
	{
		switch( ulRequest )
		{

			case ioctlUSE_INTERRUPTS :
					
				if( ulValue == pdFALSE )
				{
					NVIC_DisableIRQ(CAN_IRQn);
				}
				else
				{
					/* Enable the Rx  interrupt. */
					CAN_IRQCmd (pxCAN,CANINT_RIE, ENABLE);

					/* Enable the interrupt and set its priority to the minimum
					interrupt priority.  A separate command can be issued to raise
					the priority if desired. */
					NVIC_EnableIRQ(CAN_IRQn);
					enable_irq = 1;

				}
				break;



			case ioctlSET_SPEED :
				can_SetBaudrate (pxCAN,ulValue);
				break;


			case ioctlSET_INTERRUPT_PRIORITY :

				/* The ISR uses ISR safe FreeRTOS API functions, so the priority
				being set must be lower than (ie numerically larger than)
				configMAX_LIBRARY_INTERRUPT_PRIORITY. */
				configASSERT( ulValue >= configMAX_LIBRARY_INTERRUPT_PRIORITY );
				NVIC_SetPriority( xIRQ[ cPeripheralNumber ], ulValue );
				break;


			case ioctlSET_CAN_STD_ID :
				CAN_TxMsg.id = ulValue;
				CAN_TxMsg.format = STD_ID_FORMAT;
				break;

			case ioctlSET_CAN_EXT_ID :

				CAN_TxMsg.id = ulValue;
				CAN_TxMsg.format = EXT_ID_FORMAT;
				break;

			case ioctlSET_CAN_FRAME_TYPE :
				if(ulValue==0)
				{
				CAN_TxMsg.type =DATA_FRAME;
				}
				else
				CAN_TxMsg.type =REMOTE_FRAME;
				break;

			case ioctlSET_CAN_CONFIG_SELFTEST_MODE :
				if(ulValue == 0)
				CAN_ModeConfig(pxCAN,CAN_SELFTEST_MODE,DISABLE);
				else
				CAN_ModeConfig(pxCAN,CAN_SELFTEST_MODE,ENABLE);
				break;

			case ioctlSET_CONFIG_CANAF_MODE_BYPASS :
				if(ulValue == 1)
				CAN_SetAFMode (LPC_CANAF,CAN_AccBP);
				else
				CAN_SetAFMode (LPC_CANAF,CAN_Normal);
				break;

			case ioctlSET_CAN_FRAME_LENGTH :
				 CAN_TxMsg.len=ulValue;
				break;

			default :
				xReturn = pdFAIL;
				break;
		}
	}
	taskEXIT_CRITICAL();

	return xReturn;
}


/*--------------------------------- INTERRUPT HANDLER -------------------------------------*/
void CAN_IRQHandler(void)
{
	uint8_t CANIntStatus;
	static signed portBASE_TYPE xHigherPriorityTaskWoken;
	xHigherPriorityTaskWoken = pdFALSE;
	CANIntStatus = CAN_IntGetStatus(LPC_CAN2);
	if(CANIntStatus &0x01)
	 {
		CAN_ReceiveMsg(LPC_CAN2,&CAN_RxMsg);
		xSemaphoreGiveFromISR( xSemaphore_irq, &xHigherPriorityTaskWoken );

	 }
}

/*-----------------------------------------------------------*/


